import pytest


@pytest.fixture
def operations_from_excel():
    return {
        "Дата операции": [
            "08.04.2022 12:14:20",
            "07.04.2022 22:31:40",
            "07.04.2022 22:30:17",
            "05.04.2022 04:49:13",
            "04.04.2022 19:39:46",
            "04.04.2022 19:39:45",
            "04.04.2022 19:36:28",
            "04.04.2022 19:32:29",
            "04.04.2022 19:32:28",
            "03.04.2022 15:37:17",
        ],
        "Дата платежа": [
            "08.04.2022",
            "08.04.2022",
            "08.04.2022",
            "05.04.2022",
            "04.04.2022",
            "04.04.2022",
            "04.04.2022",
            "04.04.2022",
            "04.04.2022",
            "04.04.2022",
        ],
        "Номер карты": ["*9428", "*6158", "*9428", "*6158", 0, 0, "*9428", "*9428", "*9428", "*6158"],
        "Статус": ["OK", "OK", "OK", "OK", "OK", "OK", "OK", "OK", "FAILED", "OK"],
        "Сумма операции": [500.0, -858.0, 858.0, -260.0, 1000.0, -1000.0, 1000.0, 59.0, 59.0, -130.0],
        "Валюта операции": ["RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB"],
        "Сумма платежа": [500.0, -858.0, 858.0, -260.0, 1000.0, -1000.0, 1000.0, 59.0, 59.0, -130.0],
        "Валюта платежа": ["RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB"],
        "Кэшбэк": [0, 8.0, 0, 2.0, 0, 0, 0, 0, 0, 1.0],
        "Категория": [
            "Пополнения",
            "Рестораны",
            "Переводы",
            "Супермаркеты",
            "Переводы",
            "Переводы",
            "Пополнения",
            "Бонусы",
            "Бонусы",
            "Такси",
        ],
        "MCC": [0, 5813.0, 0, 5300.0, 0, 0, 0, 0, 0, 4121.0],
        "Описание": [
            "Мария Ж.",
            "Kamin",
            "Мария К.",
            "WILDBERRIES",
            "Перевод между счетами",
            "Перевод между счетами",
            "Мария Ж.",
            "Выплата по вашему обращению",
            "Выплата по вашему обращению",
            "Ситимобил",
        ],
        "Бонусы (включая кэшбэк)": [0.0, 8.0, 0.0, 2.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0],
        "Округление на инвесткопилку": [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
        "Сумма операции с округлением": [500.0, 858.0, 858.0, 260.0, 1000.0, 1000.0, 1000.0, 59.0, 59.0, 130.0],
    }


@pytest.fixture
def operations_list_valid():
    return [
        {
            "Дата операции": "08.04.2022 12:14:20",
            "Дата платежа": "08.04.2022",
            "Номер карты": "*9428",
            "Статус": "OK",
            "Сумма операции": 500.0,
            "Валюта операции": "RUB",
            "Сумма платежа": 500.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Пополнения",
            "MCC": 0,
            "Описание": "Мария Ж.",
            "Бонусы (включая кэшбэк)": 0.0,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 500.0,
        },
        {
            "Дата операции": "07.04.2022 22:31:40",
            "Дата платежа": "08.04.2022",
            "Номер карты": "*6158",
            "Статус": "OK",
            "Сумма операции": -858.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -858.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 8.0,
            "Категория": "Рестораны",
            "MCC": 5813.0,
            "Описание": "Kamin",
            "Бонусы (включая кэшбэк)": 8.0,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 858.0,
        },
        {
            "Дата операции": "07.04.2022 22:30:17",
            "Дата платежа": "08.04.2022",
            "Номер карты": "*9428",
            "Статус": "OK",
            "Сумма операции": 858.0,
            "Валюта операции": "RUB",
            "Сумма платежа": 858.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Переводы",
            "MCC": 0,
            "Описание": "Мария К.",
            "Бонусы (включая кэшбэк)": 0.0,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 858.0,
        },
        {
            "Дата операции": "05.04.2022 04:49:13",
            "Дата платежа": "05.04.2022",
            "Номер карты": "*6158",
            "Статус": "OK",
            "Сумма операции": -260.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -260.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 2.0,
            "Категория": "Супермаркеты",
            "MCC": 5300.0,
            "Описание": "WILDBERRIES",
            "Бонусы (включая кэшбэк)": 2.0,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 260.0,
        },
        {
            "Дата операции": "04.04.2022 19:39:46",
            "Дата платежа": "04.04.2022",
            "Номер карты": 0,
            "Статус": "OK",
            "Сумма операции": 1000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": 1000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Переводы",
            "MCC": 0,
            "Описание": "Перевод между счетами",
            "Бонусы (включая кэшбэк)": 0.0,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 1000.0,
        },
        {
            "Дата операции": "04.04.2022 19:39:45",
            "Дата платежа": "04.04.2022",
            "Номер карты": 0,
            "Статус": "OK",
            "Сумма операции": -1000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -1000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Переводы",
            "MCC": 0,
            "Описание": "Перевод между счетами",
            "Бонусы (включая кэшбэк)": 0.0,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 1000.0,
        },
        {
            "Дата операции": "04.04.2022 19:36:28",
            "Дата платежа": "04.04.2022",
            "Номер карты": "*9428",
            "Статус": "OK",
            "Сумма операции": 1000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": 1000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Пополнения",
            "MCC": 0,
            "Описание": "Мария Ж.",
            "Бонусы (включая кэшбэк)": 0.0,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 1000.0,
        },
        {
            "Дата операции": "04.04.2022 19:32:29",
            "Дата платежа": "04.04.2022",
            "Номер карты": "*9428",
            "Статус": "OK",
            "Сумма операции": 59.0,
            "Валюта операции": "RUB",
            "Сумма платежа": 59.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Бонусы",
            "MCC": 0,
            "Описание": "Выплата по вашему обращению",
            "Бонусы (включая кэшбэк)": 0.0,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 59.0,
        },
        {
            "Дата операции": "04.04.2022 19:32:28",
            "Дата платежа": "04.04.2022",
            "Номер карты": "*9428",
            "Статус": "FAILED",
            "Сумма операции": 59.0,
            "Валюта операции": "RUB",
            "Сумма платежа": 59.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Бонусы",
            "MCC": 0,
            "Описание": "Выплата по вашему обращению",
            "Бонусы (включая кэшбэк)": 0.0,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 59.0,
        },
        {
            "Дата операции": "03.04.2022 15:37:17",
            "Дата платежа": "04.04.2022",
            "Номер карты": "*6158",
            "Статус": "OK",
            "Сумма операции": -130.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -130.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 1.0,
            "Категория": "Такси",
            "MCC": 4121.0,
            "Описание": "Ситимобил",
            "Бонусы (включая кэшбэк)": 1.0,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 130.0,
        },
    ]


@pytest.fixture
def list_sorted_by_date():
    return [
        {
            "Дата операции": "05.04.2022 04:49:13",
            "Дата платежа": "05.04.2022",
            "Номер карты": "*6158",
            "Статус": "OK",
            "Сумма операции": -260.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -260.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 2.0,
            "Категория": "Супермаркеты",
            "MCC": 5300.0,
            "Описание": "WILDBERRIES",
            "Бонусы (включая кэшбэк)": 2.0,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 260.0,
        },
        {
            "Дата операции": "04.04.2022 19:39:46",
            "Дата платежа": "04.04.2022",
            "Номер карты": 0,
            "Статус": "OK",
            "Сумма операции": 1000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": 1000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Переводы",
            "MCC": 0,
            "Описание": "Перевод между счетами",
            "Бонусы (включая кэшбэк)": 0.0,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 1000.0,
        },
        {
            "Дата операции": "04.04.2022 19:39:45",
            "Дата платежа": "04.04.2022",
            "Номер карты": 0,
            "Статус": "OK",
            "Сумма операции": -1000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -1000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Переводы",
            "MCC": 0,
            "Описание": "Перевод между счетами",
            "Бонусы (включая кэшбэк)": 0.0,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 1000.0,
        },
        {
            "Дата операции": "04.04.2022 19:36:28",
            "Дата платежа": "04.04.2022",
            "Номер карты": "*9428",
            "Статус": "OK",
            "Сумма операции": 1000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": 1000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Пополнения",
            "MCC": 0,
            "Описание": "Мария Ж.",
            "Бонусы (включая кэшбэк)": 0.0,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 1000.0,
        },
        {
            "Дата операции": "04.04.2022 19:32:29",
            "Дата платежа": "04.04.2022",
            "Номер карты": "*9428",
            "Статус": "OK",
            "Сумма операции": 59.0,
            "Валюта операции": "RUB",
            "Сумма платежа": 59.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Бонусы",
            "MCC": 0,
            "Описание": "Выплата по вашему обращению",
            "Бонусы (включая кэшбэк)": 0.0,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 59.0,
        },
        {
            "Дата операции": "04.04.2022 19:32:28",
            "Дата платежа": "04.04.2022",
            "Номер карты": "*9428",
            "Статус": "FAILED",
            "Сумма операции": 59.0,
            "Валюта операции": "RUB",
            "Сумма платежа": 59.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Бонусы",
            "MCC": 0,
            "Описание": "Выплата по вашему обращению",
            "Бонусы (включая кэшбэк)": 0.0,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 59.0,
        },
        {
            "Дата операции": "03.04.2022 15:37:17",
            "Дата платежа": "04.04.2022",
            "Номер карты": "*6158",
            "Статус": "OK",
            "Сумма операции": -130.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -130.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 1.0,
            "Категория": "Такси",
            "MCC": 4121.0,
            "Описание": "Ситимобил",
            "Бонусы (включая кэшбэк)": 1.0,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 130.0,
        },
    ]


@pytest.fixture
def card_info_result():
    return [
        {"last_digits": "6158", "total_spent": 1248.00, "cashback": 12.48},
    ]


@pytest.fixture
def operations_list_invalid():
    return [
        {
            "Дата": "08.04.2022 12:14:20",
            "Платеж": "08.04.2022",
            "Номер карты": "***9428",
            "Статус": "OK",
            "Сумма": 500.0,
            "Валюта операции": "RUB",
            "Сумма платежа": 500.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Пополнения",
            "MCC": 0,
            "Описание": "Мария Ж.",
            "Бонусы (включая кэшбэк)": 0.0,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 500.0,
        },
        {
            "Дата": "07.04.2022 22:31:40",
            "Платеж": "08.04.2022",
            "Номер карты": 6158,
            "Статус": "OK",
            "Сумма": -858.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -858.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 8.0,
            "Категория": "Рестораны",
            "MCC": 5813.0,
            "Описание": "Kamin",
            "Бонусы (включая кэшбэк)": 8.0,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 858.0,
        },
        {
            "Дата операции": "07.04.2022 22:30:17",
            "Дата платежа": "08.04.2022",
            "Номер карты": "*9428",
            "Статус": "OK",
            "Сумма": 858.0,
            "Валюта операции": "RUB",
            "Сумма платежа": 858.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Переводы",
            "MCC": 0,
            "Описание": "Мария К.",
            "Бонусы (включая кэшбэк)": 0.0,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 858.0,
        },
    ]


@pytest.fixture
def top_5_operations():
    return [
        {"date": "04.04.2022", "amount": 1000.0, "category": "Переводы", "description": "Перевод между счетами"},
        {"date": "07.04.2022", "amount": 858.0, "category": "Рестораны", "description": "Kamin"},
        {"date": "05.04.2022", "amount": 260.0, "category": "Супермаркеты", "description": "WILDBERRIES"},
        {"date": "03.04.2022", "amount": 130.0, "category": "Такси", "description": "Ситимобил"},
    ]


@pytest.fixture
def result_of_currency_rate():
    return """{
  "date": "2025-01-06",
  "historical": "",
  "info": {
    "rate": 1,
    "timestamp": 1519328414
  },
  "query": {
    "amount": 25,
    "from": "USD",
    "to": "RUB"
  },
  "result": 111.655,
  "success": true
}"""


@pytest.fixture
def result_of_currency_rate_without_result():
    return """{
  "date": "2025-01-06",
  "historical": "",
  "info": {
    "rate": 1,
    "timestamp": 1519328414
  },
  "query": {
    "amount": 25,
    "from": "USD",
    "to": "RUB"
  },
  "result": "",
  "success": true
}"""


@pytest.fixture
def result_of_stocks():
    return """{"adjusted": true,
  "next_url": 
  "https://api.polygon.io/v2/aggs/ticker/AAPL/range/1/day/1578114000000/2020-01-10?cursor=bGltaXQ9MiZzb3J0PWFzYw",
  "queryCount": 2,
  "request_id": "6a7e466379af0a71039d60cc78e72282",
  "results": [
    {
      "c": 75.0875,
      "h": 75.15,
      "l": 73.7975,
      "n": 1,
      "o": 74.06,
      "t": 1577941200000,
      "v": 135647456,
      "vw": 74.6099
    },
    {
      "c": 74.3575,
      "h": 75.145,
      "l": 74.125,
      "n": 1,
      "o": 74.2875,
      "t": 1578027600000,
      "v": 146535512,
      "vw": 74.7026
    }
  ],
  "resultsCount": 2,
  "status": "OK",
  "ticker": "AAPL"}"""


@pytest.fixture
def result_of_stocks_failed():
    return (
        '{"ticker": "GOOGL", "queryCount": 0, "resultsCount": 0, "adjusted": true, '
        '"status": "DELAYED", "request_id": "0222db913d482bdd764ab88d7a4e5a92"}'
    )


@pytest.fixture
def result_cashback_categories():
    return """{"Рестораны": 8.58, "Супермаркеты": 2.6, "Такси": 1.3}"""
